uat_chat/Reports/уатВедомостьНоменклатурыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>уатВедомостьНоменклатурыТС</Name>
			<Comment>Ведомость расхода з/ч и работ на ТС (уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.уатУниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатНоменклатураТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатНоменклатураТС</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Enums/уатПолеОтчетаВидНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатПолеОтчетаВидНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаботыПоРемонту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапасныеЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Enums/уатСпособыРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатСпособыРемонта</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автосервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемЗона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Enums/уатПолеОтчетаСпособРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатПолеОтчетаСпособРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автосервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемЗона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаРасходныхМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Documents/уатВыдачаРасходныхМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатВыдачаРасходныхМатериалов</Name>
			<Comment>Выдача расходных материалов (уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.уатНоменклатураТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад, с которого берутся агрегаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Механик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПланыПримененияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>служебный реквизит отражающий сумму в валюте регл учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/Reports/уатВедомостьНоменклатурыТС/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА


// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		//уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	уатНоменклатураТСОбороты.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ГОД) КАК ПериодГод,
	|	уатНоменклатураТСОбороты.Регистратор КАК Регистратор,
	|	уатНоменклатураТСОбороты.ТС.ГаражныйНомер КАК ТСГарНомер,
	|	уатНоменклатураТСОбороты.ТС.ГосударственныйНомер КАК ТСГосНомер,
	|	уатНоменклатураТСОбороты.ТС.Колонна КАК Колонна,
	|	уатНоменклатураТСОбороты.ТС.Организация КАК Организация,
	|	уатНоменклатураТСОбороты.Номенклатура КАК Номенклатура,
	|	уатНоменклатураТСОбороты.КоличествоОборот КАК Количество,
	|	уатНоменклатураТСОбороты.СтоимостьОборот КАК Стоимость,
	|	уатНоменклатураТСОбороты.СтоимостьУпрОборот КАК СтоимостьУпр,
	|	ВЫБОР
	|		КОГДА уатНоменклатураТСОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаВидНоменклатуры.ЗапасныеЧасти)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаВидНоменклатуры.РаботыПоРемонту)
	|	КОНЕЦ КАК ВидНоменклатурыТС,
	|	ВЫБОР
	|		КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатРемонтныйЛист
	|				И уатНоменклатураТСОбороты.Регистратор.СпособРемонта = ЗНАЧЕНИЕ(Перечисление.уатСпособыРемонта.Автосервис)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.АвтоСервис)
	|		КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатРемонтныйЛист
	|				И уатНоменклатураТСОбороты.Регистратор.СпособРемонта = ЗНАЧЕНИЕ(Перечисление.уатСпособыРемонта.РемЗона)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.РемЗона)
	|		КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатВыдачаРасходныхМатериалов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.ВыдачаРасходныхМатериалов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.Прочее)
	|	КОНЕЦ КАК СпособРемонта,
	|	уатНоменклатураТСОбороты.ТС
	|{ВЫБРАТЬ
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Колонна.*,
	|	Организация.*,
	|	Номенклатура.*,
	|	Количество,
	|	Стоимость,
	|	СтоимостьУпр,
	|	ВидНоменклатурыТС.*,
	|	СпособРемонта.*,
	|	ТС.*}
	|ИЗ
	|	РегистрНакопления.уатНоменклатураТС.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК уатНоменклатураТСОбороты
	|{ГДЕ
	|	уатНоменклатураТСОбороты.Период,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ДЕНЬ)) КАК ПериодДень,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ДЕКАДА)) КАК ПериодДекада,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, МЕСЯЦ)) КАК ПериодМесяц,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, КВАРТАЛ)) КАК ПериодКвартал,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|	(НАЧАЛОПЕРИОДА(уатНоменклатураТСОбороты.Период, ГОД)) КАК ПериодГод,
	|	уатНоменклатураТСОбороты.Регистратор.*,
	|	уатНоменклатураТСОбороты.ТС.ГаражныйНомер КАК ТСГарНомер,
	|	уатНоменклатураТСОбороты.ТС.ГосударственныйНомер КАК ТСГосНомер,
	|	уатНоменклатураТСОбороты.ТС.Колонна.* КАК Колонна,
	|	уатНоменклатураТСОбороты.ТС.Организация.* КАК Организация,
	|	уатНоменклатураТСОбороты.Номенклатура.*,
	|	уатНоменклатураТСОбороты.КоличествоОборот КАК Количество,
	|	уатНоменклатураТСОбороты.СтоимостьОборот КАК Стоимость,
	|	уатНоменклатураТСОбороты.СтоимостьУпрОборот КАК СтоимостьУпр,
	|	(ВЫБОР
	|			КОГДА уатНоменклатураТСОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаВидНоменклатуры.ЗапасныеЧасти)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаВидНоменклатуры.РаботыПоРемонту)
	|		КОНЕЦ).* КАК ВидНоменклатурыТС,
	|	(ВЫБОР
	|			КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатРемонтныйЛист
	|					И уатНоменклатураТСОбороты.Регистратор.СпособРемонта = ЗНАЧЕНИЕ(Перечисление.уатСпособыРемонта.Автосервис)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.АвтоСервис)
	|			КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатРемонтныйЛист
	|					И уатНоменклатураТСОбороты.Регистратор.СпособРемонта = ЗНАЧЕНИЕ(Перечисление.уатСпособыРемонта.РемЗона)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.РемЗона)
	|			КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатВыдачаРасходныхМатериалов
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.ВыдачаРасходныхМатериалов)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаСпособРемонта.Прочее)
	|		КОНЕЦ).* КАК СпособРемонта,
	|	уатНоменклатураТСОбороты.ТС.*,
	|	(ВЫБОР
	|			КОГДА уатНоменклатураТСОбороты.ТС.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА уатНоменклатураТСОбороты.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|		КОНЕЦ) КАК ТСВыбыло}
	|{УПОРЯДОЧИТЬ ПО
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Колонна.*,
	|	Организация.*,
	|	Номенклатура.*,
	|	Количество,
	|	Стоимость,
	|	СтоимостьУпр,
	|	ВидНоменклатурыТС.*,
	|	СпособРемонта.*,
	|	ТС.*}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Стоимость),
	|	СУММА(СтоимостьУпр)
	|ПО
	|	Период,
	|	Регистратор,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Номенклатура,
	|	ВидНоменклатурыТС,
	|	Колонна,
	|	СпособРемонта,
	|	Организация
	|{ИТОГИ ПО
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Колонна.*,
	|	Организация.*,
	|	Номенклатура.*,
	|	ВидНоменклатурыТС.*,
	|	СпособРемонта.*,
	|	ТС.*}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	//Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
	//	
	//	// Добавление свойств и категорий поля запроса в таблицу полей.
	//	// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
	//	
	//	// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , 
	//                                                  <ПсевдонимПоля>, <Представление>, <Назначение>);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("уатДТП.Заказчик", "Заказчик", "Заказчик", 
	//                                ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	//	
	//	// Добавление свойств и категорий в исходный текст запроса.
	//	УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
	//	
	//КонецЕсли;
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	Пока УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Цикл
		
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки[0]);
		
	КонецЦикла;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТС"               , "ТС / оборудование (все поля)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСГарНомер"       , "ТС (гар. номер)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСГосНомер"       , "ТС (гос. номер)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидНоменклатурыТС", "Вид номенклатуры ТС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СпособРемонта"    , "Способ ремонта");	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСВыбыло" 		, "ТС выбыло");	
	
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	//// Заполнение начальных настроек универсального отчета
	//УниверсальныйОтчет.УстановитьНачальныеНастройки(Истина);
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ТС");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СпособРемонта");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ВидНоменклатурыТС");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Количество"  , "Количество"      , Истина,"ЧДЦ=3", , );
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость"   , "Стоимость (регл)", Истина,"ЧДЦ=2", , );
	Если уатРаботаСМетаданными.уатЕстьКонстанта("ВалютаУправленческогоУчета") тогда
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьУпр", "Стоимость (упр)", Истина,"ЧДЦ=2", , );
	КонецЕсли;
	
 // Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	УниверсальныйОтчет.ДобавитьОтбор("ТСГосНомер",Ложь,ВидСравнения.Содержит);
	УниверсальныйОтчет.ДобавитьОтбор("СпособРемонта");
	УниверсальныйОтчет.ДобавитьОтбор("ВидНоменклатурыТС");
	УниверсальныйОтчет.ДобавитьОтбор("Регистратор.Дата", Ложь  , ВидСравнения.ИнтервалВключаяГраницы,,,,Ложь);
	УниверсальныйОтчет.ДобавитьОтбор("ТСВыбыло"		   , Истина, ВидСравнения.Равно 				, Ложь);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	//УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ВыполнениеЗаказовНаТС", "ЗаказНаТС");	
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ТСГосНомер", ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
	//ПутьКДанным, Размещение = Неопределено, Положение = 3
	
КонецПроцедуры // УстановитьНачальныеНастройки()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 

// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	ТабличныйДокумент.ТолькоПросмотр = уатПраваИНастройки.уатПраво("ЗащитаПечатныхФорм", глПраваУАТ);
	
КонецПроцедуры // СформироватьОтчет()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 
// 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 0;
	
#КонецЕсли
